// Выведите в консоль числа от 1 до 100.

// let i = 1;
// while(i <= 100){
//     console.log(i);
//     i++;
// }

// Выведите в консоль числа 11 до 33.

// let i = 11;
// while(i <= 33){
//     console.log(i);
//     i++;
// }

// Выведите в консоль четные числа в промежутке от 0 до 100.

// let i = 0;
// while(i <= 100){
//     if(i % 2 == 0)
//     console.log(i);
//     i++;
// }

// Выведите в консоль нечетные числа в промежутке от 1 до 99.

// let i = 1;
// while(i <= 99){
//     if(i % 2 !== 0)
//     console.log(i);
//     i++;
// }

// Выведите в консоль числа от 30 до 0.

// let i = 30;
// while(i >= 0){
//     console.log(i);
//     i--;
// }


// В следующем коде программист вывел числа от 10 до 1:
// let i = 10;

// while (i >= 1) {
// 	console.log(i);
// }
// В коде, однако, была допущена ошибка, которая привела к тому, что 
// цикл выполняется бесконечно. Исправьте ошибку программиста.

// let i = 10;

// while (i >= 1) {
// 	console.log(i);
//     i--;
// }


// В следующем коде программист вывел числа от 10 до 1:

// let i = 10;

// while (i >= 1) {
// 	console.log(i);
// 	i++;
// }
// В коде, однако, была допущена ошибка, которая привела к тому,
//  что цикл выполняется бесконечно. Исправьте ошибку программиста.

// let i = 10;

// while (i >= 1) {
// 	console.log(i);
// 	i--;
// }

// В следующем коде программист вывел числа от 10 до 1:

// let i = 10;

// while (i <= 0) {
// 	console.log(i);
// 	i--;
// }
// В коде, однако, была допущена ошибка, которая привела к тому, 
// что на экран ничего не вывелось. Исправьте ошибку программиста.

// let i = 10;

// while (i >= 0) {
// 	console.log(i);
// 	i--;
// }


// В следующем коде программист вывел числа от 10 до 1:

// let i = 10;

// while (i == 0) {
// 	console.log(i);
// 	i--;
// }
// В коде, однако, была допущена ошибка, которая привела к тому, 
// что на экран ничего не вывелось. Исправьте ошибку программиста.

// let i = 10;

// while (i >= 0) {
// 	console.log(i);
// 	i--;
// }

// В следующем коде программист вывел числа от 10 до 1:

// let i = 10;

// while (i == 10) {
// 	console.log(i);
// 	i--;
// }
// В коде, однако, была допущена ошибка, которая привела к тому, что 
// цикл вывел только число 10 и закончил свою работу. Исправьте ошибку программиста.

// let i = 10;

// while (i >= 0) {
// 	console.log(i);
// 	i--;
// }

// С помощью цикла for выведите в консоль числа от 1 до 100.

// for (let i = 1; i <= 100; i++){
//     console.log(i);
// }

// С помощью цикла for выведите в консоль числа от 11 до 33.

// for (let i = 11; i <= 33; i++){
//     console.log(i);
// }

// С помощью цикла for выведите в консоль четные числа в промежутке от 0 до 100.

// for (let i = 1; i <= 100; i++){
//     if(i % 2 == 0){
//     console.log(i);
//     }
// }

// С помощью цикла for выведите в консоль нечетные числа в промежутке от 1 до 99.

// for (let i = 1; i <= 99; i++){
//     if(i % 2 !== 0){
//     console.log(i);
//     }
// }

// С помощью цикла for выведите в консоль числа от 100 до 0.

// for (let i = 100; i >= 0; i--){
//     console.log(i);
// }

// Найдите произведение целых чисел от 1 до 20.

// let result = 0;
// for (let i = 1; i <= 20; i++){
//     result += i;
// }
// console.log(result);

// Найдите сумму четных чисел от 2 до 100.

// let result = 0;
// for (let i = 2; i <= 100; i++){
//     if(i % 2 === 0){
//     result += i;
// }
// }
// console.log(result);

// Найдите сумму нечетных чисел от 1 до 99.

// let result = 0;
// for (let i = 1; i <= 99; i++){
//     if(i % 2 !== 0){
//     result += i;
// }
// }
// console.log(result);



// Дан массив с элементами 'a', 'b', 'c', 'd', 'e'. С помощью цикла for выведите все эти элементы на экран.


// let arr = ['a', 'b', 'c', 'd', 'e'];

// for (let i = 0; i < arr.length; i++){
//     console.log(arr[i]);
// }


// В следующем коде программист вывел в консоль все элементы массива:

// let arr = [1, 2, 3, 4, 5];
		
// for (let i = 0; i <= arr.length; i++) {
// 	console.log(arr[i]);
// }
// В коде, однако, была допущена ошибка, которая привела к тому, что в последней итерации цикла почему-то выводится undefined,
//  а не элемент массива. Исправьте ошибку программиста. Объясните, в чем он был не прав.

// let arr = [1, 2, 3, 4, 5];
		
// for (let i = 0; i < arr.length; i++) {
// 	console.log(arr[i]);
// }

// Дан массив с элементами 1, 2, 3, 4, 5. С помощью цикла for и оператора if выведите в консоль нечетные элементы массива.

// let arr = [1, 2, 3, 4, 5];
// for (let i = 0; i < arr.length; i++){
//     if(i % 2 === 0){
//     console.log(arr[i]);
// }
// }


// Дан массив с элементами 2, 5, 9, 15, 1, 4. С помощью цикла for и оператора if выведите в консоль те элементы массива, которые больше 3-х, но меньше 10.

// let arr = [2, 5, 9, 15, 1, 4];
// for (let i = 0; i < arr.length; i++){
//     if(arr[i] > 3 && arr[i] < 10){
//     console.log(arr[i]);
// }
// }


// Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите сумму положительных элементов массива.
// let result = 0;
// let arr = [2, 5, -9, 15, -1, -4];
// for (let i = 0; i < arr.length; i++){
//     if(arr[i] >=0 ){
//     result +=arr[i];
// }
// }
// console.log(result);

// Дан массив arr. Найдите среднее арифметическое его элементов (сумма делить на количество). Проверьте задачу на массиве с элементами 1, 2, 3, 4, 5.

// let sum = 0;
// let result = 0
// let arr = [1, 2, 3, 4, 5.];
// for (let i = 0; i < arr.length; i++){
//    sum += arr[i];
//    result = sum / arr[i];
// }
// console.log(result);


// Дан массив с числами. Выведите элементы этого массива в обратном порядке.

// let arr = [1, 2, 3];
// let j = arr.length;
// j--;
// for (let i = j; i >= 0; i--)
// console.log(arr[i]);

// Дан массив с числами. С помощью цикла выведите на экран все элементы, значение которых совпадает с их порядковым номером в массиве.


// Дан массив с числами. С помощью цикла for и функции document.write выведите каждый элемент массива с новой строки. Используйте для этого тег br.


// Дан массив с числами. С помощью цикла for и функции document.write выведите каждый элемент массива в отдельном абзаце.


// Составьте массив дней недели. С помощью цикла for выведите все дни недели, а выходные дни выведите жирным.


// Составьте массив дней недели. С помощью цикла for выведите все дни недели, а текущий день выведите курсивом. Номер текущего дня должен храниться в переменной day.