// Задача 19.1
// Не подсматривая в учебник перечислите все примитивные типы данных в JavaScript.

String,Number,Boolean,Object,Symbol,null,undefined;

// Задача 19.2
// Не запуская код, определите, что выведется на экран в консоль:
// console.log( typeof {a: 1, b: 2, c: 3} );

Object;

// Задача 19.3
// Не запуская код, определите, что выведется на экран в консоль:
// console.log( typeof [1, 2, 3] );

Object;

// Задача 19.4
// Не запуская код, определите, что выведется на экран в консоль:
// let arr = [1, 2, 3];
// console.log( typeof arr );

undefined

// Задача 19.5
// Не запуская код, определите, что выведется на экран в консоль:
// let arr = [1, 2, 3];
// console.log( typeof arr[0] );

Number;

// Задача 19.6
// Не запуская код, определите, что выведется на экран в консоль:
// let arr = ['1', '2', '3'];
// console.log( typeof arr[0] );

String;